logo_added
